In [2]:
import numpy as np
import pandas as pd
import datetime

from datetime import datetime, date

pd.set_option('display.max_columns',7)
pd.set_option('display.max_rows',10)
pd.set_option('display.width',60)

import matplotlib.pyplot as plt

In [4]:
pd.DataFrame(np.arange(1,6))

   0
0  1
1  2
2  3
3  4
4  5

In [7]:
df = pd.DataFrame(np.array([[10,11],[20,21]]))
df

    0   1
0  10  11
1  20  21

In [9]:
df.columns

RangeIndex(start=0, stop=2, step=1)

In [13]:
df = pd.DataFrame(np.array([[70,71],[90,91]]),
                    columns=['Missoula','Philadelphia'])
df

   Missoula  Philadelphia
0        70            71
1        90            91

In [15]:
len(df)

2

In [18]:
df.shape#행,열 순

(2, 2)

딕셔너리 사용해서 만들기

In [28]:
temps_missoula = [70,71]
temps_philadelphia = [90,91]

temperatures = {'Missoula':temps_missoula,
                'Philadelphia':temps_philadelphia}
pd.DataFrame(temperatures)#컬럼 타입이라 세로

   Missoula  Philadelphia
0        70            90
1        71            91

In [30]:
temps_at_time0 = pd.Series([70,90])
temps_at_time1 = pd.Series([71,91])
df = pd.DataFrame([temps_at_time0,temps_at_time1])
df

    0   1
0  70  90
1  71  91

In [25]:
temperatures = {'Missoula':[70,71],
                'Philadelphia':[90,91]}#줄을 맡추면 가독성이 좋아짐
pd.DataFrame(temperatures)#컬럼 타입이라 세로

   Missoula  Philadelphia
0        70            90
1        71            91

In [33]:
df = pd.DataFrame([temps_at_time0,temps_at_time1])
df

    0   1
0  70  90
1  71  91

csv로 DataFrame 만들기

In [36]:
sp500 = pd.read_csv("data/sp500.csv",
                    index_col='Symbol',
                    usecols=[0,2,3,7])

In [38]:
sp500

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897
...                        ...     ...         ...
YHOO    Information Technology   35.02      12.768
YUM     Consumer Discretionary   74.77       5.147
ZMH                Health Care  101.84      37.181
ZION                Financials   28.43      30.191
ZTS                Health Care   30.53       2.150

[500 rows x 3 columns]

In [41]:
sp500.head(5)

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897

In [42]:
sp500.shape

(500, 3)

In [44]:
sp500.size

1500

In [46]:
sp500.index

Index(['MMM', 'ABT', 'ABBV', 'ACN', 'ACE', 'ACT', 'ADBE',
       'AES', 'AET', 'AFL',
       ...
       'XEL', 'XRX', 'XLNX', 'XL', 'XYL', 'YHOO', 'YUM',
       'ZMH', 'ZION', 'ZTS'],
      dtype='object', name='Symbol', length=500)

In [48]:
sp500.columns

Index(['Sector', 'Price', 'Book Value'], dtype='object')

In [55]:
sp500['Sector'].head()

Symbol
MMM                Industrials
ABT                Health Care
ABBV               Health Care
ACN     Information Technology
ACE                 Financials
Name: Sector, dtype: object

In [56]:
sp500['Price'].head()

Symbol
MMM     141.14
ABT      39.60
ABBV     53.95
ACN      79.79
ACE     102.91
Name: Price, dtype: float64

In [61]:
type(sp500[['Price','Book Value']])

pandas.core.frame.DataFrame

In [62]:
sp500['Book Value']

Symbol
MMM     26.668
ABT     15.573
ABBV     2.954
ACN      8.326
ACE     86.897
         ...
YHOO    12.768
YUM      5.147
ZMH     37.181
ZION    30.191
ZTS      2.150
Name: Book Value, Length: 500, dtype: float64

In [65]:
sp500.loc['MMM']

Sector        Industrials
Price              141.14
Book Value         26.668
Name: MMM, dtype: object

In [67]:
sp500.loc[['MMM','MSFT']]

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
MSFT    Information Technology   40.12      10.584

In [70]:
sp500.iloc[[0,2]]

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABBV    Health Care   53.95       2.954

In [72]:
i1 = sp500.index.get_loc('MMM')
i2 = sp500.index.get_loc('A')

i1,i2

(0, 10)

In [73]:
sp500.iloc[[i1,i2]]

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
A       Health Care   56.18      16.928

In [79]:
sp500.iat[0,1]

141.14

In [80]:
sp500[:5]

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897

In [81]:
sp500['ABT':'ACN']

                        Sector  Price  Book Value
Symbol
ABT                Health Care  39.60      15.573
ABBV               Health Care  53.95       2.954
ACN     Information Technology  79.79       8.326

In [82]:
sp500.Price < 100

Symbol
MMM     False
ABT      True
ABBV     True
ACN      True
ACE     False
        ...
YHOO     True
YUM      True
ZMH     False
ZION     True
ZTS      True
Name: Price, Length: 500, dtype: bool

In [85]:
sp500[sp500.Price < 100]

                        Sector  Price  Book Value
Symbol
ABT                Health Care  39.60      15.573
ABBV               Health Care  53.95       2.954
ACN     Information Technology  79.79       8.326
ADBE    Information Technology  64.30      13.262
AES                  Utilities  13.61       5.781
...                        ...    ...         ...
XYL                Industrials  38.42      12.127
YHOO    Information Technology  35.02      12.768
YUM     Consumer Discretionary  74.77       5.147
ZION                Financials  28.43      30.191
ZTS                Health Care  30.53       2.150

[407 rows x 3 columns]

In [90]:
r = sp500[(sp500.Price < 10)&
         (sp500.Price > 6)]['Price']
r

Symbol
HCBK    9.80
HBAN    9.10
SLM     8.82
WIN     9.38
Name: Price, dtype: float64

In [92]:
sp500[(sp500.Sector == 'Health Care')&(sp500.Price > 100.00)][['Price','Sector']]

         Price       Sector
Symbol
ACT     213.77  Health Care
ALXN    162.30  Health Care
AGN     166.92  Health Care
AMGN    114.33  Health Care
BCR     146.62  Health Care
...        ...          ...
REGN    297.77  Health Care
TMO     115.74  Health Care
WAT     100.54  Health Care
WLP     108.82  Health Care
ZMH     101.84  Health Care

[19 rows x 2 columns]

In [94]:
sp500.loc[['ABT','ZTS']][['Sector','Price']]

             Sector  Price
Symbol
ABT     Health Care  39.60
ZTS     Health Care  30.53